{
	"WhatIsProgramming_key1": "ప్రోగ్రామింగ్ అంటే ఏమిటి?",
	"WhatIsProgramming_key2": "కంప్యూటర్‌కు <b>సూచనలు</b> ఇవ్వడం ద్వారా, సంక్లిష్ట సమస్యలను కంప్యూటర్‌లు పరిష్కరించేలా చేయవచ్చు.",
	"WhatIsProgramming_key3": "కంప్యూటర్‌కు ఇచ్చిన <b>సూచనల</b> సమితిని <b>ప్రోగ్రామ్</b> అంటారు.<br> కంప్యూటర్‌కు సూచనలు ఇచ్చే ప్రక్రియను <b>ప్రోగ్రామింగ్</b> అంటారు.",
	"WhatIsProgramming_key4": "మేము కంప్యూటర్‌కు సూచనలు(ప్రోగ్రామ్) ఇవ్వడం మరియు సంక్లిష్టమైన సమస్యను పరిష్కరించడానికి కంప్యూటర్ ఈ సూచనలను అనుసరించడం సులభం కాదా? కంప్యూటర్‌కు సూచనలు ఇవ్వడాన్ని ప్రోగ్రామింగ్ అంటారు. :)",
	"WhatIsProgramming_key5": "కానీ ఒక చిన్న సమస్య ఉంది.",
	"WhatIsProgramming_key6": "కంప్యూటర్లు మన భాష (హిందీ, తమిళం, కన్నడ) అర్థం చేసుకోలేవు. కంప్యూటర్లు 0 మరియు 1తో రూపొందించబడిన మెషిన్ లాంగ్వేజ్‌ని మాత్రమే అర్థం చేసుకోగలవు. కాబట్టి, కంప్యూటర్‌తో మెషిన్ లాంగ్వేజ్‌లో కమ్యూనికేట్ చేయడం మనకు కష్టమవుతుంది.",
	"WhatIsProgramming_key7": "అలాంటప్పుడు మనం కంప్యూటర్‌కి ఎలా సూచనలు ఇవ్వగలం?",
	"WhatIsProgramming_key8": "కాబట్టి, ఈ సమస్యను పరిష్కరించడానికి మేము (జావా, <span style=\"\">పైథాన్</span> , జావాస్క్రిప్ట్) వంటి కొన్ని భాషలను తయారు చేసాము, తద్వారా మేము కంప్యూటర్‌కు సులభంగా సూచనలను ఇవ్వగలము. &quot; <span style=\"\">కంపైలర్</span> అని పిలువబడే మరొక ప్రోగ్రామ్&quot; సహాయంతో కంప్యూటర్లు ఈ భాషలను సులభంగా యంత్ర భాషలోకి మార్చగలవు.",
	"WhatIsProgramming_key9": "కంప్యూటర్‌కు సూచనలు ఇవ్వాలంటే మనం ఈ ఇచ్చిన భాషల్లో ఏదైనా నేర్చుకోవాలి. ఈ కోర్సులో, మేము <span style=\"\">పైథాన్</span> భాషను నేర్చుకోబోతున్నాము.",
	"WhatIsProgramming_key10": "కంప్యూటర్‌కు సూచనలు ఇవ్వడానికి <span style=\"\">పైథాన్</span> భాషను ఉపయోగిస్తాము.",
	"WhatIsProgramming_key11": "కింది వీడియోలో ఎరికా (అమెజాన్‌లో ఇంజనీరింగ్ మేనేజర్) మరియు జెరోమ్ (Xboxలో ప్రోగ్రామ్ మేనేజర్) సర్క్యూట్‌లు, CPU వంటి కంప్యూటర్ హార్డ్‌వేర్‌లు మనం వ్రాసే <span style=\"\">కోడ్‌ల</span> ద్వారా ఎలా నియంత్రించబడతాయో వివరిస్తున్నారు. ప్రాథమికంగా ఒక పనిని <span style=\"\">అమలు</span> చేయడానికి హార్వేర్ మరియు సాఫ్ట్‌వేర్ ఎలా కలిసి పనిచేస్తాయి. మైక్రోసాఫ్ట్ సహ వ్యవస్థాపకుడు మరియు విండోస్ OS సృష్టికర్త అయిన బిల్ గేట్స్ OS ఎలా పనిచేస్తుందో వివరిస్తున్నారు. మీరు దీన్ని ఆనందిస్తారని ఆశిస్తున్నాను.",
	"WhatIsProgramming_key12": "<b>అప్పగింత</b>",
	"WhatIsProgramming_key13": "మీరు ఎప్పుడైనా ఎవరికైనా సూచనలు ఇచ్చారా లేదా ఎవరి నుండి అయినా సూచనలు తీసుకున్నారా. మేము దానిని <b>ప్రోగ్రామ్</b> అని పిలవవచ్చా?",
	"WhatIsProgramming_key14": "పైథాన్ భాష మరియు దాని అప్లికేషన్ల కోసం శోధించాలా? ప్రపంచంలో ఎంత మంది జావా ఉపయోగిస్తున్నారు?"
}