{
	"WhatIsProgramming_key1": "நிரலாக்கம் என்றால் என்ன?",
	"WhatIsProgramming_key2": "கணினிக்கு <b>அறிவுரைகளை</b> வழங்குவதன் மூலம், சிக்கலான சிக்கல்களைத் தீர்க்க கணினிகளை உருவாக்கலாம்.",
	"WhatIsProgramming_key3": "கம்ப்யூட்டருக்கு வழங்கப்படும் <b>அறிவுரைகளின்</b> தொகுப்பு <b>நிரல்</b> எனப்படும்.<br> கணினிக்கு வழிமுறைகளை வழங்கும் செயல்முறை <b>நிரலாக்கம்</b> என்று அழைக்கப்படுகிறது.",
	"WhatIsProgramming_key4": "கணினிக்கு நாம் வழிமுறைகளை (நிரல்) கொடுக்கிறோம், சிக்கலான சிக்கலைத் தீர்க்க கணினி இந்த வழிமுறைகளைப் பின்பற்றுகிறது என்பது எளிமையாகத் தெரியவில்லையா? கணினிக்கு அறிவுரைகளை வழங்குவது நிரலாக்கம் எனப்படும். :)",
	"WhatIsProgramming_key5": "ஆனால் ஒரு சிறிய பிரச்சனை உள்ளது.",
	"WhatIsProgramming_key6": "கணினிகளால் நம் மொழியை (இந்தி, தமிழ், கன்னடம்) புரிந்துகொள்ள முடியாது. கணினிகள் 0 மற்றும் 1 ஆகியவற்றால் உருவாக்கப்பட்ட இயந்திர மொழியை மட்டுமே புரிந்து கொள்ள முடியும். எனவே, கணினியுடன் இயந்திர மொழியில் தொடர்புகொள்வது கடினமாகிறது.",
	"WhatIsProgramming_key7": "பிறகு எப்படி கம்ப்யூட்டருக்கு அறிவுரைகளை கொடுக்க முடியும்?",
	"WhatIsProgramming_key8": "எனவே, இந்த சிக்கலை தீர்க்க நாங்கள் (ஜாவா, <span style=\"\">பைதான்</span> , ஜாவாஸ்கிரிப்ட்) போன்ற சில மொழிகளை உருவாக்கினோம், இதனால் கணினிக்கு எளிதாக வழிமுறைகளை வழங்க முடியும். &quot; <span style=\"\">கம்பைலர்</span> எனப்படும் மற்றொரு நிரலின்&quot; உதவியுடன் கணினிகள் இந்த மொழிகளை எளிதாக இயந்திர மொழியாக மாற்ற முடியும்.",
	"WhatIsProgramming_key9": "கணினிக்கு அறிவுரைகளை வழங்க, கொடுக்கப்பட்டுள்ள மொழிகளில் ஏதேனும் ஒன்றை நாம் கற்றுக் கொள்ள வேண்டும். இந்த பாடத்திட்டத்தில், நாம் <span style=\"\">மலைப்பாம்பு</span> மொழியைக் கற்கப் போகிறோம்.",
	"WhatIsProgramming_key10": "கணினிக்கு அறிவுரைகளை வழங்க <span style=\"\">பைதான்</span> மொழியைப் பயன்படுத்துவோம்.",
	"WhatIsProgramming_key11": "பின்வரும் வீடியோவில் எரிகா (அமேசானில் பொறியியல் மேலாளர்) மற்றும் ஜெரோம் (எக்ஸ்பாக்ஸில் நிரல் மேலாளர்) சர்க்யூட்கள், சிபியு போன்ற கணினி வன்பொருள்கள் நாம் எழுதும் <span style=\"\">குறியீடுகளால்</span> எவ்வாறு கட்டுப்படுத்தப்படுகின்றன என்பதை விளக்குகிறது. அடிப்படையில் ஒரு பணியைச் <span style=\"\">செயல்படுத்த ஹார்வேரும் மென்பொருளும் எவ்வாறு இணைந்து செயல்படுகின்றன</span> . மைக்ரோசாப்டின் இணை நிறுவனரும், விண்டோஸ் ஓஎஸ் உருவாக்கியவருமான பில் கேட்ஸ், ஓஎஸ் எவ்வாறு செயல்படுகிறது என்பதை விளக்குகிறார். நீங்கள் அதை அனுபவிப்பீர்கள் என்று நம்புகிறேன்.",
	"WhatIsProgramming_key12": "<b>பணி</b>",
	"WhatIsProgramming_key13": "நீங்கள் எப்போதாவது யாருக்காவது அறிவுறுத்தல்களை வழங்கியிருக்கிறீர்களா அல்லது யாரிடமிருந்தும் அறிவுறுத்தல்களைப் பெற்றிருக்கிறீர்களா? அதை <b>நிரல்</b> என்று சொல்லலாமா?",
	"WhatIsProgramming_key14": "பைதான் மொழி மற்றும் அதன் பயன்பாடுகளைத் தேடவா? உலகில் எத்தனை பேர் ஜாவாவைப் பயன்படுத்துகிறார்கள்?"
}